In [28]:
"""  
In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. 
To achieve this, follow these steps:

Establish a connection between Python and the Sakila database.

Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. 
The function should take in three parameters:

engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
month: an integer representing the month for which rental data is to be retrieved.
year: an integer representing the year for which rental data is to be retrieved.
The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, 
and return it as a pandas DataFrame.
Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as 
input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, 
for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years.
 The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.
"""

'  \nIn this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. \nTo achieve this, follow these steps:\n\nEstablish a connection between Python and the Sakila database.\n\nWrite a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. \nThe function should take in three parameters:\n\nengine: an object representing the database connection engine to be used to establish a connection to the Sakila database.\nmonth: an integer representing the month for which rental data is to be retrieved.\nyear: an integer representing the year for which rental data is to be retrieved.\nThe function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, \nand return it as a pandas DataFrame.\nDevelop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as \ninput along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.\n\nThe function should also include the month and year as parameters and use them to name the new column according to the month and year, \nfor example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".\n\nHint: Consider making use of pandas groupby()\n\nCreate a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years.\n The function should return a combined DataFrame with a new \'difference\' column, which is the difference between the number of rentals in the two months.\n'

In [29]:
!pip install cryptography

Requirement already satisfied: cryptography in ./.venv/lib/python3.12/site-packages (44.0.3)
Requirement already satisfied: cffi>=1.12 in ./.venv/lib/python3.12/site-packages (from cryptography) (1.17.1)
Requirement already satisfied: pycparser in ./.venv/lib/python3.12/site-packages (from cffi>=1.12->cryptography) (2.22)

In [30]:
!pip install pymysql

Requirement already satisfied: pymysql in ./.venv/lib/python3.12/site-packages (1.1.1)

In [31]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in ./.venv/lib/python3.12/site-packages (2.0.40)
Requirement already satisfied: greenlet>=1 in ./.venv/lib/python3.12/site-packages (from sqlalchemy) (3.2.1)
Requirement already satisfied: typing-extensions>=4.6.0 in ./.venv/lib/python3.12/site-packages (from sqlalchemy) (4.13.2)

In [32]:
!pip install pandas

Requirement already satisfied: pandas in ./.venv/lib/python3.12/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.12/site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [33]:
!pip install numpy

Requirement already satisfied: numpy in ./.venv/lib/python3.12/site-packages (2.2.5)

In [34]:
import pandas as pd
import numpy as np
import pymysql
import getpass
from sqlalchemy import create_engine

In [35]:
password= getpass.getpass()

In [36]:
db = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+db
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [41]:
from sqlalchemy import text



def rental_month(engine, month,year):
    with engine.connect() as connection:
        txt= f''' SELECT * FROM rental WHERE EXTRACT(MONTH FROM rental_date) = {month} AND EXTRACT(YEAR FROM rental_date) = {year}'''
        query = text(txt)
        result = connection.execute(query)
        return pd.DataFrame(result.all())

In [43]:
may_df=rental_month(engine, 5, 2005)
june_df = rental_month(engine, 6, 2005)

In [44]:
may_df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [46]:
june_df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

In [ ]:
def rental_count_by_month():
    with engine.connect() as connection:
        txt= f''' SELECT